<?php
echo "<br/>";
$translit_arr = [
    'а' => 'a', 'б' => 'b', 'в' => 'v',
    'г' => 'g', 'д' => 'd', 'е' => 'e',
    'ё' => 'yo', 'ж' => 'zh', 'з' => 'z',
    'и' => 'i', 'й' => 'j', 'к' => 'k',
    'л' => 'l', 'м' => 'm', 'н' => 'n',
    'о' => 'o', 'п' => 'p', 'р' => 'r',
    'с' => 's', 'т' => 't', 'у' => 'u',
    'ф' => 'f', 'х' => 'x', 'ц' => 'c',
    'ч' => 'ch', 'ш' => 'sh', 'щ' => 'shh',
    'ь' => "'", 'ы' => 'y', 'ъ' => "''",
    'э' => "e'", 'ю' => 'yu', 'я' => 'ya'
];
$translit_ARR = [
    'А' => 'A', 'Б' => 'B', 'В' => 'V',
    'Г' => 'G', 'Д' => 'D', 'Е' => 'E',
    'Ё' => 'YO', 'Ж' => 'ZH', 'З' => 'Z',
    'И' => 'I', 'Й' => 'J', 'К' => 'K',
    'Л' => 'L', 'М' => 'M', 'Н' => 'N',
    'О' => 'O', 'П' => 'P', 'Р' => 'R',
    'С' => 'S', 'Т' => 'T', 'У' => 'U',
    'Ф' => 'F', 'Х' => 'X', 'Ц' => 'C',
    'Ч' => 'CH', 'Ш' => 'SH', 'Щ' => 'SHH',
    'Ь' => "'", 'Ы' => 'Y', 'Ъ' => "''",
    'Э' => "E'", 'Ю' => 'YU', 'Я' => 'YA'
];
$str = 'Мама Мыла Раму';
echo $str, '<br>';
$str = str_replace(array_flip($translit_arr), $translit_arr, $str);
$str = str_replace(array_flip($translit_ARR), $translit_ARR, $str);
echo $str;